{"config": [{"config": {"activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "nb_col": 4, "W_constraint": null, "input_dtype": "float32", "name": "convolution2d_1", "b_constraint": null, "dim_ordering": "th", "trainable": true, "nb_row": 4, "nb_filter": 32, "bias": true, "subsample": [2, 2], "border_mode": "valid", "batch_input_shape": [null, 4, 20, 20], "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "name": "convolution2d_2", "nb_filter": 64, "dim_ordering": "th", "trainable": true, "W_constraint": null, "b_constraint": null, "activation": "relu", "subsample": [1, 1], "border_mode": "valid", "bias": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "name": "convolution2d_3", "nb_filter": 64, "dim_ordering": "th", "trainable": true, "W_constraint": null, "b_constraint": null, "activation": "relu", "subsample": [1, 1], "border_mode": "valid", "bias": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "output_dim": 512, "bias": true, "name": "dense_1", "trainable": true, "W_constraint": null, "b_constraint": null, "input_dim": null, "activation": "relu", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "output_dim": 4, "bias": true, "name": "dense_2", "trainable": true, "W_constraint": null, "b_constraint": null, "input_dim": null, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential"}