{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 32, "W_constraint": null, "dim_ordering": "th", "nb_row": 4, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "batch_input_shape": [null, 4, 20, 20], "subsample": [2, 2], "nb_col": 4, "bias": true, "input_dtype": "float32", "trainable": true, "activation": "relu", "name": "convolution2d_1", "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "nb_row": 3, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "nb_filter": 64, "nb_col": 3, "bias": true, "dim_ordering": "th", "activation": "relu", "name": "convolution2d_2", "W_constraint": null, "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "nb_row": 3, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "nb_filter": 64, "nb_col": 3, "bias": true, "dim_ordering": "th", "activation": "relu", "name": "convolution2d_3", "W_constraint": null, "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 512, "activation": "relu", "input_dim": null, "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "name": "dense_1", "W_constraint": null, "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 4, "activation": "linear", "input_dim": null, "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "name": "dense_2", "W_constraint": null, "b_constraint": null, "activity_regularizer": null}}]}