{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "activation": "relu", "nb_col": 3, "trainable": true, "b_regularizer": null, "nb_filter": 32, "input_dtype": "float32", "subsample": [1, 1], "W_regularizer": null, "border_mode": "valid", "batch_input_shape": [null, 4, 10, 20], "name": "convolution2d_1", "activity_regularizer": null, "dim_ordering": "th", "nb_row": 3, "W_constraint": null, "bias": true, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "activation": "relu", "nb_col": 2, "trainable": true, "b_regularizer": null, "nb_filter": 64, "W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "border_mode": "valid", "name": "convolution2d_2", "activity_regularizer": null, "dim_ordering": "th", "nb_row": 2, "b_constraint": null, "bias": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "b_regularizer": null, "W_constraint": null, "activation": "relu", "W_regularizer": null, "bias": true, "output_dim": 512, "name": "dense_1", "activity_regularizer": null, "b_constraint": null, "input_dim": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "b_regularizer": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "bias": true, "output_dim": 4, "name": "dense_2", "activity_regularizer": null, "b_constraint": null, "input_dim": null}}]}